---
kind: type
id: T:Autodesk.Revit.DB.ConnectorManager
source: html/101a70f9-83f7-3fd1-746e-2c7b57d8b6fc.htm
---
# Autodesk.Revit.DB.ConnectorManager

Provides access to the Connector Manager

## Syntax (C#)
```csharp
public class ConnectorManager : IDisposable
```